In [1]:
import numpy as np
import pandas as pd

## 一、长宽表的变形

什么是长表？什么是宽表？这个概念是对于某一个特征而言的。例如：一个表中把性别存储在某一个列中，那么它就是性别的长表；如果把性别作为列名，列中的元素是某一其他的相关特征数值，那么这个表是关于性别的宽表。下面的两张表就分别是关于性别的长表和宽表：

In [2]:
pd.DataFrame({'Gender':['F','F','M','M'],
              'Height':[163,160,175,180]})  # 性别值是某列的元素，则是性别的长表

  Gender  Height
0      F     163
1      F     160
2      M     175
3      M     180

In [3]:
pd.DataFrame({'Height:F':[163,160],
              'Height:M':[175,180]}) #性别作为列名，且表中元素是其他特征值，则是性别的宽表

   Height:F  Height:M
0       163       175
1       160       180

显然这两张表从信息是完全等价的，它们包含相同的身高统计数值，只是这些数值的呈现方式不同，而其呈现方式主要又与性别一列选择的布局模式有关，即到底是以long的状态存储还是以wide的状态存储。因此，pandas针对此类长宽表的变形操作设计了一些有关的变形函数。

## 1.pivot

pivot是一种典型的 长表变宽表 的函数，首先来看一个例子：下表存储了张三和李四的语文和数学分数，现在想要把语文和数学分数作为列来展示。

In [6]:
df = pd.DataFrame({'Class':[1,1,2,2],
              'Name':['San Zhang','San Zhang','Si Li','Si Li'],
              'Subject':['Chinese','Math','Chinese','Math'],
              'Grade':[80,75,90,85]})
df

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      1  San Zhang     Math     75
2      2      Si Li  Chinese     90
3      2      Si Li     Math     85

对于一个基本的长宽表的操作而言，最重要的有三个元素，分别是   变形后的行索引、需要转到列索引的列，以及这些列和行索引对应的数值，  他们分别对应了pivot方法中的index，columns，values参数。新生成表的列索引是columns对应列的unique值，而新表的行索引是index对应列的unique值，而values对了想要展示的数据。

In [7]:
df.pivot(index = 'Name',columns = 'Subject',values = 'Grade')

Subject    Chinese  Math
Name
San Zhang       80    75
Si Li           90    85

利用pivot进行变形操作需要满足唯一性的要求，即由于在新表中的行索引对应了唯一的value，因此原表中的index和columns对应两个列的行组合必须唯一。例如，现在把原表中第二行张三的数学改为语文就会报错，这是由于Name和Subject的组合中两次出现（“San Zhang”，“Chinese”），从而最后不能确定变形后应该填80分还是75分。

In [8]:
df

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      1  San Zhang     Math     75
2      2      Si Li  Chinese     90
3      2      Si Li     Math     85

In [9]:
df.loc[1,'Subject'] = 'Chinese'
df

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      1  San Zhang  Chinese     75
2      2      Si Li  Chinese     90
3      2      Si Li     Math     85

In [10]:
df.pivot(index = 'Name',columns= 'Subject',values='Grade')

ValueError: Index contains duplicate entries, cannot reshape

pandas从1.1.0开始，pivot相关的三个参数允许被设置为列表，这也意味着会返回多级索引。这里构造一个相应的例子来说明如何使用：下表中六列分别为班级、姓名、测试类型（期中考试和期末考试）、科目、成绩、排名。

In [32]:
df = pd.DataFrame({'Class':[1, 1, 2, 2, 1, 1, 2, 2],
                   'Name':['San Zhang', 'San Zhang', 'Si Li', 'Si Li',
                            'San Zhang', 'San Zhang', 'Si Li', 'Si Li'],
                   'Examination': ['Mid', 'Final', 'Mid', 'Final',
                                  'Mid', 'Final', 'Mid', 'Final'],
                   'Subject':['Chinese', 'Chinese', 'Chinese', 'Chinese',
                               'Math', 'Math', 'Math', 'Math'],
                   'Grade':[80, 75, 85, 65, 90, 85, 92, 88],
                   'rank':[10, 15, 21, 15, 20, 7, 6, 2]})
df

   Class       Name Examination  Subject  Grade  rank
0      1  San Zhang         Mid  Chinese     80    10
1      1  San Zhang       Final  Chinese     75    15
2      2      Si Li         Mid  Chinese     85    21
3      2      Si Li       Final  Chinese     65    15
4      1  San Zhang         Mid     Math     90    20
5      1  San Zhang       Final     Math     85     7
6      2      Si Li         Mid     Math     92     6
7      2      Si Li       Final     Math     88     2

现在想要把测试类型和科目联合组的四个类别（期中语文、期末语文、期中数学、期末数学）转到列索引，并且同时统计成绩和排名。

In [33]:
pivot_mulit = df.pivot(index=['Class','Name'],columns=['Examination','Subject'],values=['Grade','rank'])
pivot_mulit

                  Grade                       rank
Examination         Mid   Final  Mid Final     Mid   Final  Mid Final
Subject         Chinese Chinese Math  Math Chinese Chinese Math  Math
Class Name
1     San Zhang      80      75   90    85      10      15   20     7
2     Si Li          85      65   92    88      21      15    6     2

根据唯一性原则，新表中的行索引等价于index中的多列使用drop_duplicates(即求unique值)，而列索引长度为 values中的元素个数乘以columns的唯一组合数量（与index类似）。

## 2.pivot_table

pivot的使用依赖于唯一性条件，那如果不满足唯一性条件，那么必须通过       聚合操作使得       相 同 行 列 组 合 对 应 的 多 个 值 变 为 一 个 值  。例如，张三和李四都参加来两次语文考试和数学考试，按照学院规定，最后的成绩是两次考试分数的平均值。此时就无法通过pivpt函数来完成。

In [13]:
df = pd.DataFrame({'Name':['San Zhang', 'San Zhang',
                           'San Zhang', 'San Zhang',
                           'Si Li', 'Si Li', 'Si Li', 'Si Li'],
                   'Subject':['Chinese', 'Chinese', 'Math', 'Math',
                              'Chinese', 'Chinese', 'Math', 'Math'],
                   'Grade':[80, 90, 100, 90, 70, 80, 85, 95]})
df

        Name  Subject  Grade
0  San Zhang  Chinese     80
1  San Zhang  Chinese     90
2  San Zhang     Math    100
3  San Zhang     Math     90
4      Si Li  Chinese     70
5      Si Li  Chinese     80
6      Si Li     Math     85
7      Si Li     Math     95

pandas中提供来pivot_table来实现，其中的aggfunc参数就是使用的聚合函数。上述场景可以如下写出：

In [14]:
df.pivot_table(index='Name',columns='Subject',values='Grade',aggfunc='mean')

Subject    Chinese  Math
Name
San Zhang       85    95
Si Li           75    90

这里传入aggfunc包含了上一章中介绍的所有合法聚合字符串，此外还可以传入以序列为输入、标量为输出的聚合函数来实现自定义操作，上述功能等价写出：

In [15]:
df.pivot_table(index = 'Name',
               columns='Subject',
               values = 'Grade',
              aggfunc=lambda x:x.mean())

Subject    Chinese  Math
Name
San Zhang       85    95
Si Li           75    90

此外，pivot_table具有边际汇总的功能，可以通过设置  margins=True  来实现，其中   边际的聚合方式与aggfunc中给出的聚合方法一致  。  下面就分别统计语文和数学的平均分、张三和李四的均分，以及总体所有分数的均分：

In [17]:
df.pivot_table(index = 'Name',
               columns='Subject',
               values='Grade',
               aggfunc='mean',
               margins=True)  # 90 = (85+95)/2 ; 80 = (85+75)/2; 86.25 = (85+95+75+90)/4

Subject    Chinese  Math    All
Name
San Zhang       85  95.0  90.00
Si Li           75  90.0  82.50
All             80  92.5  86.25

##  3.melt

长宽表只是数据呈现方式的差异，但其包含的信息量是等价的，前面提到了利用pivot把长表转为宽表，那么就可以通过相应的逆操作把宽表转为长表，melt函数就起到了这样的作用。在下面的例子中，Subject以列索引的形式存储，现在想要将其压缩到一个列中。

In [18]:
df = pd.DataFrame({'Class':[1,2],
                   'Name':['San Zhang','Si Li'],
                   'Chinese':[80,90],
                   'Math':[80,75]})
df

   Class       Name  Chinese  Math
0      1  San Zhang       80    80
1      2      Si Li       90    75

In [20]:
df_melted = df.melt(id_vars=['Class','Name'],
                    value_vars=['Chinese','Math'],
                    var_name='Subject',
                    value_name='Grade')
df_melted

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      2      Si Li  Chinese     90
2      1  San Zhang     Math     80
3      2      Si Li     Math     75

前面提到melt和pivot是一组互逆过程，那么就一定可以通过pivot操作把df_melted转回df的形式：

In [21]:
df_unmelted = df_melted.pivot(index=['Class','Name'],
                              columns='Subject',
                              values='Grade')
df_unmelted

Subject          Chinese  Math
Class Name
1     San Zhang       80    80
2     Si Li           90    75

In [22]:
df_unmelted = df_unmelted.reset_index().rename_axis(columns = {'Subject':''})
df_unmelted  #恢复索引，并且重命名列索引名称

   Class       Name  Chinese  Math
0      1  San Zhang       80    80
1      2      Si Li       90    75

In [23]:
df_unmelted == df

   Class  Name  Chinese  Math
0   True  True     True  True
1   True  True     True  True

In [24]:
df_unmelted.equals(df)

True

## 2.wide_to_long

melt方法中，在列索引中被压缩的一组值对应的列元素只能代表同一层次的含义，即values_name。现在如果列中包含了交叉类别，比如期中期末的类别和语文数学的类别，那么想要把values_name对应的Grade扩充为两列分别对应语文分数和数学分数，只把期中期末的信息压缩，这种需求下就要使用wide_to_long函数来完成。

In [40]:
df = pd.DataFrame({'Class':[1,2],'Name':['San Zhang','Si Li'],
                   'Chinese_Mid':[80,75],'Math_Mid':[90,85],
                   'Chinese_Final':[80,75],'Math_Final':[90,85]})
df

   Class       Name  Chinese_Mid  Math_Mid  Chinese_Final  Math_Final
0      1  San Zhang           80        90             80          90
1      2      Si Li           75        85             75          85

In [27]:
pd.wide_to_long(df,stubnames=['Chinese','Math'],
                i = ['Class','Name'],j = 'Examination',
                sep = '_',suffix='.+')

                             Chinese  Math
Class Name      Examination
1     San Zhang Mid               80    90
                Final             80    90
2     Si Li     Mid               75    85
                Final             75    85

下面给出一个比较复杂的案例，把之前在 pivot 一节中多列操作的结果（产生了多级索引），利用 wide_to_long 函数，将其转为原来的形态。其中，使用了第八章的 str.split 函数，目前暂时只需将其理解为对序列按照某个分隔符进行拆分即可。

In [41]:
res = pivot_mulit.copy()
res.columns = res.columns.map(lambda x:'_'.join(x))
res = res.reset_index()
res = pd.wide_to_long(res,stubnames=['Grade','rank'],
                      i = ['Class','Name'],j = 'Subject_Examination',
                      sep='_',suffix='.+')
res = res.reset_index() 
res

   Class       Name Subject_Examination  Grade  rank
0      1  San Zhang         Mid_Chinese     80    10
1      1  San Zhang       Final_Chinese     75    15
2      1  San Zhang            Mid_Math     90    20
3      1  San Zhang          Final_Math     85     7
4      2      Si Li         Mid_Chinese     85    21
5      2      Si Li       Final_Chinese     65    15
6      2      Si Li            Mid_Math     92     6
7      2      Si Li          Final_Math     88     2

In [42]:
res[['Subject', 'Examination']] = res['Subject_Examination'].str.split('_', expand=True)
res = res[['Class', 'Name', 'Examination','Subject', 'Grade', 'rank']].sort_values('Subject')
res = res.reset_index(drop=True)
res

   Class       Name Examination Subject  Grade  rank
0      1  San Zhang     Chinese   Final     75    15
1      1  San Zhang        Math   Final     85     7
2      2      Si Li     Chinese   Final     65    15
3      2      Si Li        Math   Final     88     2
4      1  San Zhang     Chinese     Mid     80    10
5      1  San Zhang        Math     Mid     90    20
6      2      Si Li     Chinese     Mid     85    21
7      2      Si Li        Math     Mid     92     6

## 二、索引的变形
## 1.stack与unstack

在第二章中提到了利用swaplevel或reoder_levels进行索引内部的层交换，下面就要讨论 行列索引之间 的交换，由于这种交换带来列DataFrame维度上的变化，因此属于变形操作。在第一节提到的4中变形函数与其不同之处在于，它们都属于某一 列 或几 列  元素 和 列索引 之间的转换，而不是索引之间的转换。

In [43]:
df = pd.DataFrame(np.ones((4,2)),
                  index=pd.Index([('A','cat','big'),
                                  ('A','dog','small'),
                                  ('B','cat','big'),
                                  ('B','dog','small')]),
                  columns=['col_1','col_2'])
df

             col_1  col_2
A cat big      1.0    1.0
  dog small    1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [44]:
df.unstack() # unstack()函数的作用就是把行索引转为列索引 ，优先最内层？？

      col_1       col_2
        big small   big small
A cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0
B cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0

unstack 的主要参数就是移动的层数，默认转化 最内层 ， 移动到列索引的最内层，同时支持同时转化多个层：

In [45]:
df

             col_1  col_2
A cat big      1.0    1.0
  dog small    1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [46]:
df.unstack(2)

      col_1       col_2
        big small   big small
A cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0
B cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0

In [47]:
df.unstack(1)

        col_1      col_2
          cat  dog   cat  dog
A big     1.0  NaN   1.0  NaN
  small   NaN  1.0   NaN  1.0
B big     1.0  NaN   1.0  NaN
  small   NaN  1.0   NaN  1.0

In [48]:
df.unstack([0,2])

    col_1                  col_2
        A          B           A          B
      big small  big small   big small  big small
cat   1.0   NaN  1.0   NaN   1.0   NaN  1.0   NaN
dog   NaN   1.0  NaN   1.0   NaN   1.0  NaN   1.0

类似于pivot中的唯一性要求，在unstack中必须保证 被转化列索引的行索引层和被保留的行索引层 构成的组合是唯一的，例如把前面两个列索引改成相同的破坏唯一性，就会报错：

In [49]:
my_index = df.index.to_list()
my_index

[('A', 'cat', 'big'),
 ('A', 'dog', 'small'),
 ('B', 'cat', 'big'),
 ('B', 'dog', 'small')]

In [50]:
my_index[1] = my_index[0]
my_index

[('A', 'cat', 'big'),
 ('A', 'cat', 'big'),
 ('B', 'cat', 'big'),
 ('B', 'dog', 'small')]

In [51]:
df.index = pd.Index(my_index)
df

             col_1  col_2
A cat big      1.0    1.0
      big      1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [52]:
df.unstack()

ValueError: Index contains duplicate entries, cannot reshape

与unstack 相反 stack就是把 列索引 的层压入 行索引 ，其用法类似。

In [53]:
df = pd.DataFrame(np.ones((4,2)),
                  index=pd.Index([('A','cat','big'),
                                  ('A','dog','small'),
                                  ('B','cat','big'),
                                  ('B','dog','small')]),
                  columns=['index_1','index_2']).T
df

           A          B
         cat   dog  cat   dog
         big small  big small
index_1  1.0   1.0  1.0   1.0
index_2  1.0   1.0  1.0   1.0

In [54]:
df.stack()

                 A         B
               cat  dog  cat  dog
index_1 big    1.0  NaN  1.0  NaN
        small  NaN  1.0  NaN  1.0
index_2 big    1.0  NaN  1.0  NaN
        small  NaN  1.0  NaN  1.0

In [55]:
df.stack([1,2])

                     A    B
index_1 cat big    1.0  1.0
        dog small  1.0  1.0
index_2 cat big    1.0  1.0
        dog small  1.0  1.0

## 2.聚合与变形的关系

在上面介绍的所有函数中，除了带有聚合效果的 pivot_table 以外，所有的函数在变形前后并不会带来 values 个数的改变，只是这些值在呈现的形式上发生了变化。在上一章讨论的分组聚合操作，由于生成了新的行列索引，因此必然也属于某种特殊的变形操作，但由于聚合之后把原来的多个值变为了一个值，因此 values 的个数产生了变化，这也是分组聚合与变形函数的最大区别。

## 三、其他变形函数
## 1.crosstab

crosstab并不是一个指的推荐使用的函数，因为它能实现的所有功能pivot_table都能完成，并且速度更快。在默认状态下，crosstab可以统计元素组合出现的频次，即count操作。例如统计learn_pandas数据集中学校和转系情况对应的频数：

In [56]:
df = pd.read_csv('learn_pandas.csv')
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [57]:
pd.crosstab(index = df.School,columns=df.Transfer)

Transfer                        N  Y
School
Fudan University               38  1
Peking University              28  2
Shanghai Jiao Tong University  53  0
Tsinghua University            62  4

这等价于如下 crosstab 的如下写法，这里的 aggfunc 即聚合参数：

In [58]:
pd.crosstab(index = df.School,columns=df.Transfer,
            values=[0]*df.shape[0],aggfunc='count')

Transfer                          N    Y
School
Fudan University               38.0  1.0
Peking University              28.0  2.0
Shanghai Jiao Tong University  53.0  NaN
Tsinghua University            62.0  4.0

同样，可以利用 pivot_table 进行等价操作，由于这里统计的是组合的频数，因此 values 参数无论传入哪一个列都不会影响最后的结果：

In [59]:
df.pivot_table(index='School',
               columns='Transfer',
               values='Name',
               aggfunc='count')

Transfer                          N    Y
School
Fudan University               38.0  1.0
Peking University              28.0  2.0
Shanghai Jiao Tong University  53.0  NaN
Tsinghua University            62.0  4.0

从上面可以看出这两个函数的区别在于， crosstab 的对应位置传入的是具体的序列，而 pivot_table 传入的是被调用表对应的名字，若传入序列对应的值则会报错。

除了默认状态下的 count 统计，所有的聚合字符串和返回标量的自定义函数都是可用的，例如统计对应组合的身高均值：

In [60]:
pd.crosstab(index = df.School, columns = df.Transfer,values = df.Height, aggfunc = 'mean')

Transfer                                N       Y
School
Fudan University               162.043750  177.20
Peking University              163.429630  162.40
Shanghai Jiao Tong University  163.953846     NaN
Tsinghua University            163.253571  164.55

## 2.explode

explode 参数能够对某一列的元素进行纵向的展开，被展开的单元格必须存储 list, tuple, Series, np.ndarray 中的一种类型。

In [61]:
df_ex = pd.DataFrame({'A':[[1,2],'my_str',{1,2},pd.Series([3,4])],'B':1})
df_ex

                            A  B
0                      [1, 2]  1
1                      my_str  1
2                      {1, 2}  1
3  0    3
1    4
dtype: int64  1

In [62]:
df_ex.explode('A')

        A  B
0       1  1
0       2  1
1  my_str  1
2  {1, 2}  1
3       3  1
3       4  1

## 3. get_dummies

get_dummies 是用于特征构建的重要函数之一，其作用是把类别特征转为指示变量。例如，对年级一列转为指示变量，属于某一个年级的对应列标记为1，否则为0：

In [63]:
pd.get_dummies(df.Grade).head()

   Freshman  Junior  Senior  Sophomore
0         1       0       0          0
1         1       0       0          0
2         0       0       1          0
3         0       0       0          1
4         0       0       0          1